[
    {
      "id": "CIS 4500",
      "name": "Database and Information Systems",
      "description": "This course provides an introduction to the broad field of database and information systems, covering a variety of topics relating to structured data, ranging from data modeling to logical foundations and popular languages, to system implementations. We will study the theory of relational and XML data design; the basics of query languages; efficient storage of data, execution of queries and query optimization; transactions and updates; web-database development; and 'big data' and NoSQL systems.",
      "available": "Fall or Spring",
      "cu": "1 Course Unit",
      "prereq": "CIS 1210 AND CIS 1600",
      "syllabus": "courses/syllabi/cis4500.txt",
      "mutuallyExclusive": "CIS 5500",
      "labels": ["Object-Oriented Programming", "Discrete Mathematics", "Operating Systems", "Computer Networks", "Database Systems", "NoSQL Databases", "SQL and Relational Databases", "Machine Learning", "Simulation and Modeling", "Data Science", "Optimization Techniques", "JavaScript Programming"]
    },
    {
      "id": "CIS 4510",
      "name": "Computer and Network Security",
      "description": "This is an introduction to topics in the security of computer systems and communication on networks of computers. The course covers four major areas: fundamentals of cryptography, security for communication protocols, security for operating systems and mobile programs, and security for electronic commerce. Sample specific topics include: passwords and offline attacks, DES, RSA, DSA, SHA, SSL, CBC, IPSec, SET, DDoS attacks, biometric authentication, PKI, smart cards, S/MIME, privacy on the Web, viruses, security models, wireless security, and sandboxing. Students will be expected to display knowledge of both theory and practice through written examinations and programming assignments.",
      "available": "Fall or Spring",
      "cu": "1 Course Unit",
      "prereq": "CIS 1600 AND CIS 2400",
      "syllabus": "courses/syllabi/cis4510.txt",
      "mutuallyExclusive": "CIS 5510",
      "labels": ["Data Structures", "Mathematical Foundations", "Operating Systems", "Computer Networks", "Internet and Web Systems", "Database Systems", "SQL and Relational Databases", "Computer and Network Security", "Cryptography", "Privacy and Security", "Game Development"]
    },
    {
      "id": "CIS 4550",
      "name": "Internet and Web Systems",
      "description": "This course focuses on the challenges encountered in building Internet and web systems: scalability, interoperability (of data and code), security and fault tolerance, consistency models, and location of resources, services, and data. We will examine how XML standards enable information exchange; how web services support cross-platform interoperability (and what their limitations are); how to build high-performance application servers; how 'cloud computing' services work; how to perform Akamai-like content distribution; and how to provide transaction support in distributed environments. We will study techniques for locating machines, resources, and data (including directory systems, information retrieval indexing, ranking, and web search); and we will investigate how different architectures support scalability (and the issues they face). We will also examine ideas that have been proposed for tomorrow's Web, and we will see some of the challenges, research directions, and potential pitfalls. An important goal of the course is not simply to discuss issues and solutions, but to provide hands-on experience with a substantial implementation project. This semester's project will be a peer-to-peer implementation of a Googe-style search engine, including distributed, scalable crawling; indexing with ranking; and even PageRank. As a side-effect of the material of this course you will learn about some aspects of large-scale software development assimilating large APIs. Prerequisite: Familiarity with threads and concurrency, strong Java programming skills.",
      "available": "Fall or Spring",
      "cu": "1 Course Unit",
      "prereq": "",
      "syllabus": "courses/syllabi/cis4550.txt",
      "mutuallyExclusive": "CIS 5550",
      "labels": ["Data Structures", "Operating Systems", "Computer Networks", "Distributed Systems", "Internet and Web Systems", "Cloud Computing", "Big Data Analytics", "Human–Computer Interaction", "Web Development", "Frontend Development", "Backend Development", "Machine Learning", "Neural Networks", "Reinforcement Learning", "Augmented Reality", "Parallel Computing", "Capstone Projects", "Java Programming", "Debugging Techniques", "Concurrent Programming Techniques", "Graph Algorithms", "Dynamic Programming", "NLP Techniques"]
    },
    {
      "id": "CIS 4600",
      "name": "Interactive Computer Graphics",
      "description": "This course focuses on programming the essential mathematical and geometric concepts underlying modern computer graphics. Using 3D interactive implementations, it covers fundamental topics such as mesh data structures, transformation sequences, rendering algorithms, and curve interpolation for animation. Students are also introduced to two programming languages widely used in the computer graphics industry: C++ and GLSL. The curriculum is heavily project-based, and culminates in a group project focused on building an interactive first-person world exploration application using the various real-time interaction and rendering algorithms learned throughout the semester.",
      "available": "Fall or Spring",
      "cu": "1 Course Unit",
      "prereq": "CIS 1210",
      "syllabus": "courses/syllabi/cis4600.txt",
      "labels": ["Data Structures", "Operating Systems", "Computer Networks", "Neural Networks", "Reinforcement Learning", "Computer Animation", "Simulation and Modeling", "Capstone Projects"]
    }
]